<?php

return [
    /*
    |--------------------------------------------------------------------------
    | Дефолтний драйвер
    |--------------------------------------------------------------------------
    |
    | Тут вказується назва платіжного шлюзу, який буде використовуватися
    | за замовчуванням, якщо не вказати інший явно через Payment::driver().
    |
    */
    'default' => env('PAYMENT_DEFAULT_DRIVER', 'dummy'),

    /*
    |--------------------------------------------------------------------------
    | Модель для збереження платежів
    |--------------------------------------------------------------------------
    |
    | Якщо пакет буде зберігати історію платежів у базу (що ми обговорювали),
    | тут можна вказати модель основного проєкту, яка цим керує.
    |
    */
    'model' => \Meridaura\PaymentManager\Models\Payment::class,

    'drivers' => [
        'monobank' => [
            'base_url' => 'https://api.monobank.ua/api/',
            'token' => 'uVEcBpvn-IBwADYbL_8meX5VX2XUTMICdXJ58-RJJ89E',
        ],
    ]
];